app/controllers/posts_controller.rb

  def index
    @post = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(permit_post)
    if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-02-11 05:27:48 UTC], ["updated_at", 2017-02-11 05:27:48 UTC]]